---
title: Relational database extensions
---

import { Tabs, TabItem } from '@astrojs/starlight/components';

Kùzu supports direct scanning from a variety of relational databases using the `LOAD FROM` statement.
Because RDBMSs are a common source of structured data in enterprises, the purpose behind this set of Kùzu
extensions is to allow users to scan data from external relational databases without having to copy it
to a graph database. In the future, we plan on extending this functionality to run Cypher queries
directly on top of tables that sit in an external RDBMS.

The currently available relational database extensions, as well as their minimum required versions,
are shown below:

Extension Name | Description | Minimum Version
:---:|:---:|:---:
`duckdb` | Scan from an attached DuckDB database | 0.10.0
`postgres` | Scan from an attached PostgreSQL database | 14.0
`sqlite` | Scan from an attached SQLite database | 3.3.0

## Usage

Click through each tab in this section to see the example usage for your extension of choice.

<Tabs>

<TabItem label="DuckDB">

The DuckDB extension can be installed and loaded by running the following commands using the Kùzu CLI
or your preferred language client API:

```
INSTALL duckdb;
LOAD EXTENSION duckdb;
```

#### 1. Create a DuckDB database

To illustrate the usage of this extension, we create a sample DuckDB database of university
students in Python.

```py
import duckdb

conn = duckdb.connect('university.db')

# Insert data to person table
conn.execute("CREATE TABLE IF NOT EXISTS person (name VARCHAR, age INTEGER);")
conn.execute("INSERT INTO person values ('Alice', 30);")
conn.execute("INSERT INTO person values ('Bob', 27);")
conn.execute("INSERT INTO person values ('Carol', 19);")
conn.execute("INSERT INTO person values ('Dan', 25);")
```

#### 2. Attach database

```sql
ATTACH [DB_PATH] AS [alias] (dbtype duckdb)
```

- `DB_PATH`: Path to the DuckDB database instance (can be relative or absolute path)
- `alias`: Database alias to use in Kùzu - If not provided, the database name from DuckDB will be used.
  When attaching multiple databases, it's recommended to use aliasing.

The below example shows how the `university.db` DuckDB database can be attached to Kùzu using
the alias `uw`:

```sql
ATTACH 'university.db' AS uw (dbtype duckdb);
```

#### 3. Scan from DuckDB tables

Finally, we can utilize the `LOAD FROM` statement to scan the `person` table.

```sql
LOAD FROM uw.person
RETURN *
```

Result:

```
---------------
| name  | age |
---------------
| Alice | 30  |
---------------
| Bob   | 27  |
---------------
| Carol | 19  |
---------------
| Dan   | 25  |
---------------
```

#### 4. Reference database via alias

You can utilize the `USE` statement for attached databases to use a default database name for future operations.
This can be used when reading from an attached database to avoid specifying the full database name
as a prefix to the table name.

Consider the same attached database as above:

```sql
ATTACH 'university.db' AS uw (dbtype duckdb);
```

Instead of defining the database name for each subsequent clause like this:

```sql
LOAD FROM uw.person
RETURN *
```

You can do:

```sql
USE uw;
LOAD FROM person
RETURN *
```

#### 5. Copy data from DuckDB tables

One important use case of the DuckDB extension is to facilitate seamless data transfer from DuckDB to Kùzu.
In this example, we continue using the `university.db` database created in the last step, but this time,
we copy the data and persist it to Kùzu. This is done with the [`COPY FROM` query results feature](../import/copy-from-query-results).

##### Create a `Person` table in Kùzu

We first create a `Person` table in Kùzu which has the same schema as the one defined in DuckDB.

```cypher
CREATE NODE TABLE Person (name STRING, age INT32, PRIMARY KEY(name));
```

##### Copy the data to Kùzu

We can reference the created alias `uw` to copy data from the DuckDB table to the Kùzu table.

```sql
COPY Person FROM uw.person;
```

#### 6. Query the data in Kùzu

Finally, we can verify the data in the `Person` table in Kùzu.

```cypher
MATCH (p:Person) RETURN p.*;
```

Result:
```
------------------
| p.name | p.age |
------------------
| Alice  | 30    |
------------------
| Bob    | 27    |
------------------
| Carol  | 19    |
------------------
| Dan    | 25    |
------------------
```

#### 7. Clear attached database schema cache

To avoid redundantly retrieving schema information from attached databases, Kùzu maintains a schema cache
including table names and their respective columns and types. Should modifications occur in the schema
via an alternate connection to attached databases (DuckDB or some other attached database), such as creation or deletion of tables, the cached
schema data may become obsolete. You can use the `clear_attached_db_cache()` function to refresh cached
schema information in such cases.

```sql
CALL clear_attached_db_cache() RETURN *
```
Note: this call function will clear cache of all attached databases.

#### 8. Detach database

To detach a database, use `DETACH [ALIAS]` as follows:

```
DETACH uw
```

</TabItem>

<TabItem label="Postgres">

The PostgreSQL extension can be installed and loaded by running the following commands using the Kùzu CLI
or your preferred language client API:

```
INSTALL postgres;
LOAD EXTENSION postgres;
```

#### Set up a PostgreSQL server via Docker

During local development, it's convenient to set up a PostgreSQL server using Docker. Run the following
command to start a PostgreSQL server locally:

```sh
docker run --name kuzu-postgres -e POSTGRES_PASSWORD=testpassword -p 5432:5432 --rm postgres:latest
```

Note that the storage volume for this database is not persistent and will be deleted once the
container is stopped. Moreover, the password in this case is provided via plain text, which is not
recommended in a real use case, so the below example is for **testing purposes only**.

#### 1. Create a sample PostgreSQL database

To illustrate the usage of the extension, we create a sample Postgres database of university
students. We will use [asyncpg](https://magicstack.github.io/asyncpg/current/index.html),
an asynchronous PostgreSQL client library for Python, to create the database and insert some sample data
via a Python script.
This step assumes you have run `pip install asyncpg` to install the library, and are using Python 3.10+.

```py
import asyncio
import asyncpg

async def main():
    conn = await asyncpg.connect('postgresql://postgres:testpassword@localhost:5432/postgres')
    # Create and insert data to a new table
    try:
        await conn.execute("CREATE TABLE IF NOT EXISTS person (name VARCHAR, age INTEGER);")
        await conn.execute("INSERT INTO person (name, age) VALUES ('Alice', 30)")
        await conn.execute("INSERT INTO person (name, age) VALUES ('Bob', 27)")
        await conn.execute("INSERT INTO person (name, age) VALUES ('Carol', 19)")
        await conn.execute("INSERT INTO person (name, age) VALUES ('Dan', 25)")
    except asyncpg.exceptions.DuplicateTableError:
        print(f"Table already exists, skipping creation and insertion...")
    # Check results
    print(await conn.fetch("SELECT * FROM person"))

asyncio.run(main())
```

#### 2. Attach database

```sql
ATTACH [PG_CONNECTION_STRING] AS [alias] (dbtype postgres)
```

The below example shows how the `university` PostgreSQL database can be attached to Kùzu using
the alias `uw`:

```sql
ATTACH 'dbname=university user=postgres host=localhost password=testpassword port=5432' AS uw (dbtype postgres);
```

The `ATTACH` statement requires the following parameters:

- `PG_CONNECTION_STRING`: PostgreSQL connection string with the necessary parameters
- `alias`: Database alias to use in Kùzu - If not provided, the database name from PostgreSQL will be used.
  When attaching multiple databases, it's recommended to use aliasing.

The below table lists some common connection string parameters:

| Parameter | Description | Default |
|-----------|-------------| ------- |
| `dbname`    | Database name | [user defined] |
| `host`      | Host IP address | `localhost` |
| `user`      | Postgres username | `postgres` |
| `password`  | Postgres password | [empty] |
| `port`      | Port number | 5432 |

#### 3. Scan from PostgreSQL tables

Finally, we can utilize the `LOAD FROM` statement to scan the `Person` table.

```sql
LOAD FROM uw.person
RETURN *
```

Result:

```
---------------
| name  | age |
---------------
| Alice | 30  |
---------------
| Bob   | 27  |
---------------
| Carol | 19  |
---------------
| Dan   | 25  |
---------------
```

#### 4. Reference database via alias

You can utilize the `USE` statement for attached databases to use a default database name for future operations.
This can be used when reading from an attached database to avoid specifying the full database name
as a prefix to the table name.

Consider the same attached database as above:

```sql
ATTACH 'university' AS uw (dbtype postgres);
```

Instead of defining the Postgres database name for each subsequent clause like this:

```sql
LOAD FROM uw.person
RETURN *
```

You can do:

```sql
USE uw;
LOAD FROM person
RETURN *
```

#### 5. Copy data from PostgreSQL tables

One important use case of the PostgreSQL extension is to facilitate seamless data transfer from PostgreSQL to Kùzu.
In this example, we continue using the `university` database created in the last step, but this time,
we copy the data and persist it to Kùzu. This is done with the [`COPY FROM` query results feature](../import/copy-from-query-results).

##### Create a `Person` table in Kùzu

We first create a `Person` table in Kùzu which has the same schema as the one defined in PostgreSQL.

```sql
CREATE NODE TABLE Person (name STRING, age INT32, PRIMARY KEY(name));
```

##### Copy the data to Kùzu

We can reference the created alias `uw` to copy data from the PostgreSQL table to the Kùzu table.

```sql
COPY Person FROM uw.person;
```

#### 6. Query the data in Kùzu

Finally, we can verify the data in the `Person` table in Kùzu.

```cypher
MATCH (p:Person) RETURN p.*;
```

Result:
```
------------------
| s.name | s.age |
------------------
| Alice  | 30    |
------------------
| Bob    | 27    |
------------------
| Carol  | 19    |
------------------
| Dan    | 25    |
------------------
```

#### 7. Clear attached database schema cache

To avoid redundantly retrieving schema information from attached databases, Kùzu maintains a schema cache
including table names and their respective columns and types. Should modifications occur in the schema
via an alternate connection to attached databases (PosgreSQL or some other attached database), such as creation or deletion of tables, the cached
schema data may become obsolete. You can use the `clear_attached_db_cache()` function to refresh cached
schema information in such cases.

```sql
CALL clear_attached_db_cache() RETURN *;
```

Note: this call function will clear cache of all attached databases.

#### 8. Detach database

To detach a database, use `DETACH [ALIAS]` as follows:

```
DETACH uw
```

</TabItem>

<TabItem label="SQLite">

The SQLite extension can be installed and loaded by running the following commands using the Kùzu CLI
or your preferred language client API:

```
INSTALL sqlite;
LOAD EXTENSION sqlite;
```

#### 1. Create a SQLite database

To illustrate the usage of this extension, we create a sample SQLite database of university
students in Python.

```py
import sqlite3
conn = sqlite3.connect('university.db')
cursor = conn.cursor()

cursor.execute("CREATE TABLE IF NOT EXISTS person (name VARCHAR, age INTEGER);")
cursor.execute("INSERT INTO person (name, age) VALUES ('Alice', 30);")
cursor.execute("INSERT INTO person (name, age) VALUES ('Bob', 27);")
cursor.execute("INSERT INTO person (name, age) VALUES ('Carol', 19);")
cursor.execute("INSERT INTO person (name, age) VALUES ('Dan', 25);")
conn.commit()
conn.close()
```

#### 2. Attach database

```sql
ATTACH [DB_PATH] AS [alias] (dbtype sqlite)
```

- `DB_PATH`: Path to the SQLite database instance (can be relative or absolute path)
- `alias`: Database alias to use in Kùzu - If not provided, the database name from DuckDB will be used.
  When attaching multiple databases, it's recommended to use aliasing.

The below example shows how the `university.db` SQLite database can be attached to Kùzu using
the alias `uw`:

```sql
ATTACH 'university.db' AS uw (dbtype sqlite);
```

#### 3. Scan from SQLite tables

Finally, we can utilize the `LOAD FROM` statement to scan the `person` table.

```sql
LOAD FROM uw.person
RETURN *
```

Result:

```
---------------
| name  | age |
---------------
| Alice | 30  |
---------------
| Bob   | 27  |
---------------
| Carol | 19  |
---------------
| Dan   | 25  |
---------------
```

#### 4. Reference database via alias

You can utilize the `USE` statement for attached databases to use a default database name for future operations.
This can be used when reading from an attached database to avoid specifying the full database name
as a prefix to the table name.

Consider the same attached database as above:

```sql
ATTACH 'university.db' AS uw (dbtype sqlite);
```

Instead of defining the database name for each subsequent clause like this:

```sql
LOAD FROM uw.person
RETURN *
```

You can do:

```sql
USE uw;
LOAD FROM person
RETURN *
```

#### 5. Copy data from SQLite tables

One important use case of the DuckDB extension is to facilitate seamless data transfer from SQLite to Kùzu.
In this example, we continue using the `university.db` database created in the last step, but this time,
we copy the data and persist it to Kùzu. This is done with the [`COPY FROM` query results feature](../import/copy-from-query-results).

##### Create a `Person` table in Kùzu

We first create a `Person` table in Kùzu which has the same schema as the one defined in SQLite.

```sql
CREATE NODE TABLE Person (name STRING, age INT64, PRIMARY KEY(name));
```

##### Copy the data to Kùzu

We can reference the created alias `uw` to copy data from the SQLite table to the Kùzu table.

```sql
COPY Person FROM uw.person;
```

#### 6. Query the data in Kùzu

Finally, we can verify the data in the `Person` table in Kùzu.

```cypher
MATCH (p:Person) RETURN p.*;
```

Result:
```
------------------
| p.name | p.age |
------------------
| Alice  | 30    |
------------------
| Bob    | 27    |
------------------
| Carol  | 19    |
------------------
| Dan    | 25    |
------------------
```

#### 7. Clear attached database schema cache

To avoid redundantly retrieving schema information from attached databases, Kùzu maintains a schema cache
including table names and their respective columns and types. Should modifications occur in the schema
via an alternate connection to attached databases (SQLite or some other attached database), such as creation or deletion of tables, the cached
schema data may become obsolete. You can use the `clear_attached_db_cache()` function to refresh cached
schema information in such cases.

```sql
CALL clear_attached_db_cache() RETURN *
```
Note: this call function will clear cache of all attached databases.

#### 8. Detach database

To detach a database, use `DETACH [ALIAS]` as follows:

```
DETACH uw
```

</TabItem>

</Tabs>