---
slug: kuzu-0.1.0-release
authors: [team]
tags: [release]
---


# Kùzu 0.1.0 Release

We are very happy to release Kùzu 0.1.0 today! This is a major release with the following features and improvements:

<!--truncate-->

## New Storage Layer

Kùzu has moved to a node-group based storage design.

**TODO(Guodong)**: 
- Fill this section.

### String Compression

Together with new storage design, we introduce dictionary compression algorithm for strings. 

**TODO(Guodong & Ben)**: 
- Fill this section.
- Micro benchmark LDBC100 Comment.
  - Data size.
  - Loading performance.
  - Scan performance.
- (Optional) Discuss the generalization of bit packing to integer, offset, ...

## New Features

### Scan DataFrame
Kùzu now supports scanning over Pandas DataFrame as a regular table through

Consider the following DataFrame,
```
data = {
    'id': np.array([0, 1, 2], dtype=np.int64),
    'age': np.array([20, 32, 42], dtype=np.uint32)
}
df = pd.DataFrame(data)
```
The query below finds all person who are older than the average age computed from the given DataFrame.
```
query = "CALL read_pandas('df') 
         WITH AVG(age) AS avg_age 
         MATCH (a:Person) 
         WHERE a.age > avg_age 
         RETURN a;"
results = conn.execute(query)
```

**TODO(Ziyi)**:
- I think we should try to support the following case.

You can also load a DataFrame directly into a node or relationship table.
```
conn.execute("CREATE NODE TABLE pd (id INT64, age UINT32, PRIMARY KEY(id))")
query = "Copy pd FROM read_pandas('df');"
results = conn.execute(query)
```

### Copy

#### Copy To Parquet
Query result can be exported to Parquet format.
```
COPY ( MATCH (a:Person) RETURN a.* ) TO "person.parquet";
```

#### Copy To CSV
We added serveral configurations when exporting to CSV format.
```
COPY ( MATCH (a:Person) RETURN a.* ) TO "person.csv" (delim = '|', header=true);
```

We also improved the performance of CSV writer. A micro benchmark on LDBC100 can found below.

`COPY (MATCH (p:Comment) RETURN p.*) to ‘comment.csv’;`

| Version     | Performance (s) |
|-------------|-----------------|
| v0.0.10     | 1239.3          |
| v0.1.0      | 104.56          |



#### Copy From Column Reorder
Similar to Postgres, user can now add column names in `COPY FROM`. Column names specify columns to be copied and can be a subset of total columns with arbitrary order.

```
CREATE NODE TABLE Person (id INT64, name STRING, comment STRING, PRIMARY KEY(id));
COPY Person (name, id) FROM "person.csv";
```
The code above first create a Person table with 3 columns and then loads the two columns from file into `name` and `id` respectively. `comment` column will be set to default `NULL` value.


### Updates

#### Detach Delete
TODO(Guodong):
- Implement this
TODO(Xiyang):
- Fill section

#### Return Deleted Row
```
DELETE (a:Person) RETURN a;
```

#### Read Follows Update

TODO(Xiyang):
- Find a reasonable example.

### Others

#### Cast

We have moved to SQL-style casting function `cast(input, target type)`. User can cast an input expression to any type as long as a cast is defined between input type and target type. For example, `INT[]` to `INT` is not defined.
```
RETURN cast("[1,2,3]", "INT[]");
RETURN cast(1.2, "STRING");
```

#### INT128

We added 16 bytes huge integer.

#### Recursive Relationship Node Filter 

Kùzu now supports filtering intermediate node over recursive relationship.
```
Match p = (a:User)-[:Follows*1..2 (r, n | WHERE n.age > 21)]->(b:User) 
RETURN p;
```
Details can be found [here](../docs/cypher/query-clauses/match.md#filter-variable-length-relationships).

#### Count Subquery

## Development

### Nightly Build
We have setup a nightly build pipeline for those who want to access latest feature set.

To install nightly build version
TODO(Chang)
- Fill section.

### Reduce Binary Size
We removed arrow as a third party dependency and obtain a signifcant drop of binary size.