---
slug: kuzu-0.1.0-release
authors: [team]
tags: [release]
---


# Kùzu 0.1.0 Release

We are very happy to release Kùzu 0.1.0 today! This is a major release with the following features and improvements:

<!--truncate-->

## New Storage Layer

Kùzu has moved to a node-group based storage design.

**TODO(Guodong)**: 
- Fill this section.

### String Compression

String storage has been reworked to support dictionary compression, letting Kùzu store duplicated strings only once (per node group).
Strings are now stored in three columns internally: two make up the dictionary; one storing the raw string data, and another storing the start offset of each string, and the third column stores the indices in the dictionary of each string node. The offset and index columns are bitpacked in the manner of integer columns (in practice these cannot benefit from frame of reference compression since they always start from 0).
Additionally, strings can now cross page boundaries on-disk, letting string data be stored without gaps.

**TODO(Guodong & Ben)**: 
- Fill this section.
- Micro benchmark LDBC100 Comment.
  - Data size.
  - Loading performance.
  - Scan performance.
- (Optional) Discuss the generalization of bit packing to integer, offset, ...

Copy Benchmark:
    LDBC-100 comment table
    (TODO): Choose a subset of data to demo

|         | Version 0.0.10 | Version 0.1.0 |
|---------|----------------|---------------|
| 40 threads | 130.609s      | 131.219s      |
| 20 threads | 130.249s      | 133.606s      |
| 10 threads | 129.738s      | 129.655s      |
| 8 threads  | 130.158s      | 122.814s      |
| 4 threads  | 160.329s      | 171.814s      |
| 2 threads  | 270.545s      | 292.094s      |
| 1 threads  | 512.480s      | 549.882s      |

    LDBC-100 person_likes_comment table
  
    
|         | Version 0.0.10 | Version 0.10.0 | Performance Difference |
|---------|----------------|----------------|-------------------------|
| 40 threads | 244.193s      | 187.652s      | +23.08%                 |
| 20 threads | 239.545s      | 191.811s      | +24.96%                 |
| 10 threads | 251.105s      | 226.691s      | +10.24%                 |
| 8 threads  | 266.763s      | 229.821s      | +13.81%                 |
| 4 threads  | 312.461s      | 246.847s      | +21.02%                 |
| 2 threads  | 446.717s      | 335.631s      | +24.81%                 |
| 1 threads  | 700.847s      | 581.885s      | +16.96%                 |


LDBC-100 comment table with serial column as primary key and single string property:

| Property Name | Version 0.0.10 | Version 0.10.0 | Size Difference |
|---------------|----------------|----------------|------------------|
| Browser Used  | 4.2 GB         | 272 MB         | -93.52%          |
| Content       | 9.7 GB         | 7.5 GB         | -22.68%          |
| Location IP   | 5 GB           | 1.6 GB         | -68.00%          |




## New Features

### Scan DataFrame
Kùzu now supports scanning over Pandas DataFrame as a regular table

Consider the following DataFrame,
```
id = np.array([0, 2, 3, 5, 7, 11, 13], dtype=np.int64)
age = np.array([42, 23, 33, 57, 67, 39, 11], dtype=np.uint16)
height_in_cm = np.array([167, 172, 183, 199, 149, 154, 165], dtype=np.uint32)
is_student = np.array([False, True, False, False, False, False, True], dtype=bool)
person = pd.DataFrame({'id': id, 'age': age, 'height': height_in_cm, 'is_student': is_student})
```
The query below finds all students who is taller than the average person
```
query = 'CALL READ_PANDAS("person")
          with avg(height / 2.54) as height_in_inch
          MATCH (s:student)
          WHERE s.height > height_in_inch
          RETURN s'
results = conn.execute(query)
```

**TODO(Ziyi)**:
- I think we should try to support the following case.

You can also load a DataFrame directly into a node or relationship table.
```
conn.execute("CREATE NODE TABLE pd (id INT64, age UINT32, PRIMARY KEY(id))")
query = "Copy pd FROM read_pandas('df');"
results = conn.execute(query)
```

### Copy

#### Copy To Parquet
Query result can now be exported to Parquet format.
```
COPY ( MATCH (a:Person) RETURN a.* ) TO "person.parquet";
```

#### Copy To CSV
We added serveral configurations when exporting to CSV format.
```
COPY ( MATCH (a:Person) RETURN a.* ) TO "person.csv" (delim = '|', header=true);
```

We also improved the performance of CSV writer. Below is a micor benchmark of exporting LDBC100 Comment table to CSV format. 
```
COPY (MATCH (p:Comment) RETURN p.*) to ‘comment.csv’;
```

| Version     | Performance (s) |
|-------------|-----------------|
| v0.0.10     | 1239.3          |
| v0.1.0      | 104.56          |


#### Copy From Column Reorder
Similar to Postgres, user can now add column names in `COPY FROM`. Column names specify columns to be copied and can be a subset of total columns with arbitrary order.

```
CREATE NODE TABLE Person (id INT64, name STRING, comment STRING, PRIMARY KEY(id));
COPY Person (name, id) FROM "person.csv";
```
The code above first create a Person table with 3 columns and then loads the two columns from file into `name` and `id` respectively. `comment` column will be set to default `NULL` value.

Details can be found [here](../docs/cypher/copy.md).

### Updates

#### Detach Delete

Kùzu now supports `DETACH DELETE` which can delete a node and all its relationships.
The following query delete user "Adam" and all edges connected to "Adam".
```
MATCH (u:User) WHERE u.name = 'Adam' DETACH DELETE u;
```

To delete all records in the database, run
```
MATCH (n) DETACH DELETE n;
```

Details can be found [here](../docs/cypher/data-manipulation-clauses/delete.md#detach-delete).

#### Return Deleted Row

You can now retuned deleted records.
```
DELETE (a:Person) RETURN a.*;
```

#### Read Follows Update

TODO(Xiyang):
- Find a reasonable example.

### Others

#### Cast

We have moved to SQL-style casting function `cast(input, target type)`. User can cast an input expression to any type as long as a cast is defined between input type and target type. For example, `INT[]` to `INT` is not defined.
```
RETURN cast("[1,2,3]", "INT[]");
RETURN cast(1.2, "STRING");
```
Details can be found [here](../docs/cypher/expressions/casting.md).

#### INT128

We added 16 bytes huge integer.

#### Recursive Relationship Node Filter 

Kùzu now supports filtering intermediate node over recursive relationship.
```
Match p = (a:User)-[:Follows*1..2 (r, n | WHERE n.age > 21)]->(b:User) 
RETURN p;
```
Details can be found [here](../docs/cypher/query-clauses/match.md#filter-variable-length-relationships).

#### Count Subquery

Count subquery checks the number of matches for given pattern in the graph.

The following query counts number of followers for each user.
```
MATCH (a:User) 
RETURN a.name, COUNT { MATCH (a)<-[:Follows]-(b:User) } AS num_follower 
ORDER BY num_follower;
```
Details can be found [here](../docs/cypher/subquery.md#count-subquery).

## Development

### Nightly Build
We have setup a nightly build pipeline for those who want to access latest feature set.

To install nightly build version
TODO(Chang)
- Fill section.

### Reduce Binary Size
We removed arrow as a third party dependency and obtain a signifcant drop of binary size.
