---
slug: kuzu-0.0.7-release
authors: [team]
tags: [release]
---

# Kùzu 0.0.7 Release
We are very happy to release Kùzu 0.0.7 today! This release comes with the following new main features and improvements: 

TODO: index

<!--truncate-->

For installing the new version, 
please visit the [download section of our website](https://kuzudb.com/#download) 
and [getting started guide](https://kuzudb.com/docusaurus/getting-started/) and the full
[release notes are here](https://github.com/kuzudb/kuzu/releases). 

## Node Group Based Storage for Node Table

- describe node group based storage
- describe null bits compression
- show bechmark numbers

## Cypher Features

### Merge Clause
This release introduces `MERGE` clause which is an updating clause that will first try to match the given pattern and, if not found, create the pattern. At a high level, `MERGE <pattern>` can be interrepted as `If MATCH <pattern> then RETURN <pattern> ELES CREATE <patten>`. Additionally, user can specify further `SET` operation based on whether the pattern is found or not through `ON CREATE` and `ON MATCH`.

For example, the following query tries to merge a user node with name "Adam". Since the tuple exists in the database, we update its age property and return the tuple.
```
MERGE (n:User {name : 'Adam'}) ON MATCH SET n.age = 35 RETURN n.*;
------------------
| n.name | n.age |
------------------
| Adam   | 35    |
------------------
```
Below is another example where we try to merge a follows edge since 2022 between "Adam" and "Karissa".
```
MATCH (a:User), (b:User) 
WHERE a.name = 'Adam' AND b.name = 'Karissa' 
MERGE (a)-[e:Follows {since:2022}]->(b) 
ON CREATE SET e.since = 1999
RETURN e;
---------------------------------------------------------
| e                                                     |
---------------------------------------------------------
| (0:0)-{_LABEL: Follows, _ID: 0:5, since: 1999}->(0:1) |
---------------------------------------------------------
```

### Create Macro 

## Data Export

## Data Types

### MAP


### UNION

## Client APIs

### C++ UDF
Ziyi

### Arrow related conversion
Ben
